/**
 * Created by Administrator on 2018/7/31.
 */
// jshint ignore: start
+function($){

    $.rawCitiesData = [
        {
            "name":"赣州市公安局",
            "code":"130000",
            "sub":[
                {
                    "name":"章贡区公安局",
                    "code":"130100",
                    "sub":[
                        {
                            "name":"赣江派出所",
                            "code":"130101"
                        },
                        {
                            "name":"解放派出所",
                            "code":"130102"
                        },
                        {
                            "name":"南外派出所",
                            "code":"130104"
                        },
                        {
                            "name":"水东派出所",
                            "code":"130105"
                        },
                        {
                            "name":"水西派出所",
                            "code":"130107"
                        },
                        {
                            "name":"水南派出所",
                            "code":"130108"
                        },
                        {
                            "name":"沙石派出所",
                            "code":"130109"
                        },
                        {
                            "name":"沙河派出所",
                            "code":"130110"
                        },
                        {
                            "name":"东外派出所",
                            "code":"130111"
                        }
                    ]
                },
                {
                    "name":"南康区公安局",
                    "code":"130200",
                    "sub":[
                        {
                            "name":"蓉江派出所",
                            "code":"130201"
                        },
                        {
                            "name":"唐江派出所",
                            "code":"130202"
                        },
                        {
                            "name":"金鸡派出所",
                            "code":"130203"
                        },
                        {
                            "name":"赤土派出所",
                            "code":"130204"
                        },
                        {
                            "name":"横市派出所",
                            "code":"130205"
                        },
                        {
                            "name":"龙岭派出所",
                            "code":"130207"
                        },
                        {
                            "name":"龙回派出所",
                            "code":"130208"
                        },
                        {
                            "name":"镜坝派出所",
                            "code":"130209"
                        },
                        {
                            "name":"浮石派出所",
                            "code":"130223"
                        },
                        {
                            "name":"横寨派出所",
                            "code":"130224"
                        },
                        {
                            "name":"朱坊派出所",
                            "code":"130225"
                        },
                        {
                            "name":"太窝派出所",
                            "code":"130227"
                        },
                        {
                            "name":"龙华派出所",
                            "code":"130229"
                        },
                        {
                            "name":"十八塘派出所",
                            "code":"130281"
                        },
                        {
                            "name":"大坪派出所",
                            "code":"130283"
                        },
                        {
                            "name":"坪市派出所",
                            "code":"130284"
                        },
                        {
                            "name":"麻双派出所",
                            "code":"130285"
                        },
                        {
                            "name":"隆木派出所",
                            "code":"130286"
                        }
                    ]
                },
                {
                    "name":"赣县公安局",
                    "code":"130300",
                    "sub":[
                        {
                            "name":"梅林派出所",
                            "code":"130301"
                        },
                        {
                            "name":"王母渡派出所",
                            "code":"130302"
                        },
                        {
                            "name":"沙地派出所",
                            "code":"130303"
                        },
                        {
                            "name":"茅店派出所",
                            "code":"130304"
                        },
                        {
                            "name":"江口派出所",
                            "code":"130321"
                        },
                        {
                            "name":"吉埠派出所",
                            "code":"130322"
                        },
                        {
                            "name":"南塘派出所",
                            "code":"130323"
                        },
                        {
                            "name":"田村派出所",
                            "code":"130324"
                        },
                        {
                            "name":"韩坊派出所",
                            "code":"130325"
                        },
                        {
                            "name":"阳埠派出所",
                            "code":"130326"
                        },
                        {
                            "name":"大埠派出所",
                            "code":"130327"
                        },
                        {
                            "name":"长洛派出所",
                            "code":"130328"
                        },
                        {
                            "name":"大田派出所",
                            "code":"130329"
                        },
                        {
                            "name":"五云派出所",
                            "code":"130330"
                        },
                        {
                            "name":"湖江派出所",
                            "code":"130331"
                        },
                        {
                            "name":"储潭派出所",
                            "code":"130332"
                        },
                        {
                            "name":"石芫派出所",
                            "code":"130333"
                        },
                        {
                            "name":"三溪派出所",
                            "code":"130334"
                        },
                        {
                            "name":"白鹭派出所",
                            "code":"130335"
                        },
                    ]
                },
                {
                    "name":"信丰县公安局",
                    "code":"130400",
                    "sub":[
                        {
                            "name":"高桥派出所",
                            "code":"130401"
                        },
                        {
                            "name":"大桥派出所",
                            "code":"130402"
                        },
                        {
                            "name":"大塘埠派出所",
                            "code":"130403"
                        },
                        {
                            "name":"古陂派出所",
                            "code":"130404"
                        },
                        {
                            "name":"新田派出所",
                            "code":"130406"
                        },
                        {
                            "name":"安西派出所",
                            "code":"130421"
                        },
                        {
                            "name":"小江派出所",
                            "code":"130423"
                        },
                        {
                            "name":"大阿派出所",
                            "code":"130424"
                        },
                        {
                            "name":"油山派出所",
                            "code":"130425"
                        },
                        {
                            "name":"小河派出所",
                            "code":"130426"
                        },
                        {
                            "name":"西牛派出所",
                            "code":"130427"
                        },
                        {
                            "name":"崇仙派出所",
                            "code":"130428"
                        },
                        {
                            "name":"正平派出所",
                            "code":"130429"
                        },
                        {
                            "name":"万隆派出所",
                            "code":"130430"
                        },
                        {
                            "name":"虎山派出所",
                            "code":"130431"
                        }
                    ]
                },
                {
                    "name":"大余县公安局",
                    "code":"130500",
                    "sub":[
                        {
                            "name":"南安派出所",
                            "code":"130501"
                        },
                        {
                            "name":"大龙派出所",
                            "code":"130502"
                        },
                        {
                            "name":"大江派出所",
                            "code":"130503"
                        },
                        {
                            "name":"下垄派出所",
                            "code":"130521"
                        },
                        {
                            "name":"新城派出所",
                            "code":"130522"
                        },
                        {
                            "name":"池江派出所",
                            "code":"130523"
                        },
                        {
                            "name":"青龙派出所",
                            "code":"130524"
                        },
                        {
                            "name":"左拔派出所",
                            "code":"130525"
                        },
                        {
                            "name":"黄龙派出所",
                            "code":"130526"
                        },
                        {
                            "name":"浮江派出所",
                            "code":"130527"
                        },
                        {
                            "name":"吉村派出所",
                            "code":"130528"
                        },
                        {
                            "name":"河洞派出所",
                            "code":"130529"
                        },
                        {
                            "name":"内良派出所",
                            "code":"130530"
                        }
                    ]
                },
                {
                    "name":"上犹县公安局",
                    "code":"130600",
                    "sub":[
                        {
                            "name":"东山派出所",
                            "code":"130601"
                        },
                        {
                            "name":"营前派出所",
                            "code":"130602"
                        },
                        {
                            "name":"黄埠派出所",
                            "code":"130603"
                        },
                        {
                            "name":"油石派出所",
                            "code":"130604"
                        },
                        {
                            "name":"社溪派出所",
                            "code":"130621"
                        },
                        {
                            "name":"寺下派出所",
                            "code":"130622"
                        },
                        {
                            "name":"紫阳派出所",
                            "code":"130623"
                        },
                        {
                            "name":"陡水派出所",
                            "code":"130624"
                        },
                        {
                            "name":"五指峰派出所",
                            "code":"130625"
                        },
                        {
                            "name":"水岩派出所",
                            "code":"130626"
                        },
                        {
                            "name":"梅水派出所",
                            "code":"130627"
                        }
                    ]
                },
                {
                    "name":"崇义县公安局",
                    "code":"130700",
                    "sub":[
                        {
                            "name":"横水派出所",
                            "code":"130701"
                        },
                        {
                            "name":"过埠派出所",
                            "code":"130702"
                        },
                        {
                            "name":"扬眉派出所",
                            "code":"130703"
                        },
                        {
                            "name":"铅厂派出所",
                            "code":"130705"
                        },
                        {
                            "name":"长龙派出所",
                            "code":"130706"
                        },
                        {
                            "name":"关田派出所",
                            "code":"130721"
                        },
                        {
                            "name":"思顺派出所",
                            "code":"130722"
                        },
                        {
                            "name":"麟潭派出所",
                            "code":"130723"
                        },
                        {
                            "name":"聂都派出所",
                            "code":"130724"
                        },
                        {
                            "name":"文英派出所",
                            "code":"130725"
                        },
                        {
                            "name":"丰州派出所",
                            "code":"130726"
                        }
                    ]
                },
                {
                    "name":"安远县公安局",
                    "code":"130800",
                    "sub":[
                        {
                            "name":"欣山派出所",
                            "code":"130801"
                        },
                        {
                            "name":"天心派出所",
                            "code":"130802"
                        },
                        {
                            "name":"龙布派出所",
                            "code":"130803"
                        },
                        {
                            "name":"版石派出所",
                            "code":"130804"
                        },
                        {
                            "name":"孔田派出所",
                            "code":"130821"
                        },
                        {
                            "name":"镇岗派出所",
                            "code":"130822"
                        },
                        {
                            "name":"凤山派出所",
                            "code":"130823"
                        },
                        {
                            "name":"新龙派出所",
                            "code":"130824"
                        },
                        {
                            "name":"车头派出所",
                            "code":"130825"
                        },
                        {
                            "name":"蔡坊派出所",
                            "code":"130826"
                        },
                        {
                            "name":"重石派出所",
                            "code":"130827"
                        },
                        {
                            "name":"长沙派出所",
                            "code":"130828"
                        },
                        {
                            "name":"重石派出所",
                            "code":"130827"
                        },
                        {
                            "name":"浮槎派出所",
                            "code":"130828"
                        },
                        {
                            "name":"高云山派出所",
                            "code":"130829"
                        },
                        {
                            "name":"三百山派出所",
                            "code":"130830"
                        },
                        {
                            "name":"鹤仔派出所",
                            "code":"130831"
                        }
                    ]
                },
                {
                    "name":"龙南县公安局",
                    "code":"130900",
                    "sub":[
                        {
                            "name":"武当派出所",
                            "code":"130901"
                        },
                        {
                            "name":"杨村派出所",
                            "code":"130902"
                        },
                        {
                            "name":"汶龙派出所",
                            "code":"130903"
                        },
                        {
                            "name":"程龙派出所",
                            "code":"130921"
                        },
                        {
                            "name":"里仁派出所",
                            "code":"130922"
                        },
                        {
                            "name":"关西派出所",
                            "code":"130923"
                        },
                        {
                            "name":"渡江派出所",
                            "code":"130924"
                        },
                        {
                            "name":"桃江派出所",
                            "code":"130925"
                        },
                        {
                            "name":"临塘派出所",
                            "code":"130926"
                        },
                        {
                            "name":"南亨派出所",
                            "code":"130927"
                        },
                        {
                            "name":"夹湖派出所",
                            "code":"130928"
                        },
                        {
                            "name":"东江派出所",
                            "code":"130929"
                        },
                        {
                            "name":"九连山派出所",
                            "code":"130930"
                        }
                    ]
                },
                {
                    "name":"定南县公安局",
                    "code":"131000",
                    "sub":[
                        {
                            "name":"历市派出所",
                            "code":"131001"
                        },
                        {
                            "name":"岿美山派出所",
                            "code":"131002"
                        },
                        {
                            "name":"老城派出所",
                            "code":"131003"
                        },
                        {
                            "name":"天九派出所",
                            "code":"131022"
                        },
                        {
                            "name":"岭北派出所",
                            "code":"131023"
                        },
                        {
                            "name":"龙塘派出所",
                            "code":"131024"
                        },
                        {
                            "name":"鹅公派出所",
                            "code":"131025"
                        }
                    ]
                },
                {
                    "name":"全南县公安局",
                    "code":"131100",
                    "sub":[
                        {
                            "name":"城厢派出所",
                            "code":"131101"
                        },
                        {
                            "name":"金龙派出所",
                            "code":"131102"
                        },
                        {
                            "name":"中寨派出所",
                            "code":"131121"
                        },
                        {
                            "name":"南迳派出所",
                            "code":"131122"
                        },
                        {
                            "name":"大吉山派出所",
                            "code":"131123"
                        },
                        {
                            "name":"龙源坝派出所",
                            "code":"131124"
                        },
                        {
                            "name":"陂头派出所",
                            "code":"131125"
                        },
                        {
                            "name":"社迳派出所",
                            "code":"131126"
                        },
                        {
                            "name":"龙下派出所",
                            "code":"131127"
                        },
                        {
                            "name":"五里亭派出所",
                            "code":"131128"
                        }
                    ]
                },
                {
                    "name":"宁都县公安局",
                    "code":"131200",
                    "sub":[
                        {
                            "name":"梅江派出所",
                            "code":"131201"
                        },
                        {
                            "name":"竹笮派出所",
                            "code":"131202"
                        },
                        {
                            "name":"青塘派出所",
                            "code":"131221"
                        },
                        {
                            "name":"赖村派出所",
                            "code":"131222"
                        },
                        {
                            "name":"长胜派出所",
                            "code":"131223"
                        },
                        {
                            "name":"田头派出所",
                            "code":"131224"
                        },
                        {
                            "name":"黄石派出所",
                            "code":"131225"
                        },
                        {
                            "name":"对坊派出所",
                            "code":"131226"
                        },
                        {
                            "name":"固村派出所",
                            "code":"131227"
                        },
                        {
                            "name":"固厚派出所",
                            "code":"131229"
                        },
                        {
                            "name":"田埠派出所",
                            "code":"131230"
                        },
                        {
                            "name":"会同派出所",
                            "code":"131231"
                        },
                        {
                            "name":"湛田派出所",
                            "code":"131232"
                        },
                        {
                            "name":"石上派出所",
                            "code":"131233"
                        },
                        {
                            "name":"安福派出所",
                            "code":"131234"
                        },
                        {
                            "name":"东山坝派出所",
                            "code":"131235"
                        },
                        {
                            "name":"洛口派出所",
                            "code":"131236"
                        },
                        {
                            "name":"东韶派出所",
                            "code":"131237"
                        },
                        {
                            "name":"肖田派出所",
                            "code":"131238"
                        },
                        {
                            "name":"黄陂派出所",
                            "code":"131239"
                        },
                        {
                            "name":"钓峰派出所",
                            "code":"131240"
                        },
                        {
                            "name":"蔡江派出所",
                            "code":"131241"
                        },
                        {
                            "name":"大沽派出所",
                            "code":"131242"
                        },
                        {
                            "name":"小布派出所",
                            "code":"131243"
                        }
                    ]
                },
                {
                    "name":"于都县公安局",
                    "code":"131300",
                    "sub":[
                        {
                            "name":"贡江派出所",
                            "code":"131301"
                        },
                        {
                            "name":"盘古山派出所",
                            "code":"131302"
                        },
                        {
                            "name":"铁山垅派出所",
                            "code":"131321"
                        },
                        {
                            "name":"银坑派出所",
                            "code":"131322"
                        },
                        {
                            "name":"祁禄山派出所",
                            "code":"131323"
                        },
                        {
                            "name":"罗坳派出所",
                            "code":"131324"
                        },
                        {
                            "name":"禾丰派出所",
                            "code":"131325"
                        },
                        {
                            "name":"岭背派出所",
                            "code":"131326"
                        },
                        {
                            "name":"仙下派出所",
                            "code":"131327"
                        },
                        {
                            "name":"车溪派出所",
                            "code":"131329"
                        },
                        {
                            "name":"段屋派出所",
                            "code":"131330"
                        },
                        {
                            "name":"马安派出所",
                            "code":"131331"
                        },
                        {
                            "name":"桥头派出所",
                            "code":"131332"
                        },
                        {
                            "name":"葛坳派出所",
                            "code":"131333"
                        },
                        {
                            "name":"梓山派出所",
                            "code":"131334"
                        },
                        {
                            "name":"黄麟派出所",
                            "code":"131335"
                        },
                        {
                            "name":"宽田派出所",
                            "code":"131336"
                        },
                        {
                            "name":"沙心派出所",
                            "code":"131337"
                        },
                        {
                            "name":"利村派出所",
                            "code":"131338"
                        },
                        {
                            "name":"新陂派出所",
                            "code":"131339"
                        },
                        {
                            "name":"小溪派出所",
                            "code":"131340"
                        },
                        {
                            "name":"罗江派出所",
                            "code":"131341"
                        },
                        {
                            "name":"靖石派出所",
                            "code":"131342"
                        },
                        {
                            "name":"于都工业园派出所",
                            "code":"131343"
                        }
                    ]
                },
                {
                    "name":"兴国县公安局",
                    "code":"131400",
                    "sub":[
                        {
                            "name":"潋江派出所",
                            "code":"131401"
                        },
                        {
                            "name":"兴江派出所",
                            "code":"131402"
                        },
                        {
                            "name":"古龙岗派出所",
                            "code":"131421"
                        },
                        {
                            "name":"梅窖派出所",
                            "code":"131422"
                        },
                        {
                            "name":"樟木派出所",
                            "code":"131423"
                        },
                        {
                            "name":"东村派出所",
                            "code":"131424"
                        },
                        {
                            "name":"兴莲派出所",
                            "code":"131425"
                        },
                        {
                            "name":"江背派出所",
                            "code":"131426"
                        },
                        {
                            "name":"杰村派出所",
                            "code":"131427"
                        },
                        {
                            "name":"社富派出所",
                            "code":"131429"
                        },
                        {
                            "name":"龙口派出所",
                            "code":"131430"
                        },
                        {
                            "name":"埠头派出所",
                            "code":"131431"
                        },
                        {
                            "name":"永丰派出所",
                            "code":"131432"
                        },
                        {
                            "name":"隆坪派出所",
                            "code":"131433"
                        },
                        {
                            "name":"均村派出所",
                            "code":"131434"
                        },
                        {
                            "name":"茶园派出所",
                            "code":"131435"
                        },
                        {
                            "name":"高兴派出所",
                            "code":"131436"
                        },
                        {
                            "name":"崇贤派出所",
                            "code":"131437"
                        },
                        {
                            "name":"枫边派出所",
                            "code":"131438"
                        },
                        {
                            "name":"南坑派出所",
                            "code":"131439"
                        },
                        {
                            "name":"良村派出所",
                            "code":"131440"
                        },
                        {
                            "name":"城岗派出所",
                            "code":"131441"
                        },
                        {
                            "name":"方太派出所",
                            "code":"131442"
                        },
                        {
                            "name":"鼎龙派出所",
                            "code":"131443"
                        },
                        {
                            "name":"长冈派出所",
                            "code":"131444"
                        },
                        {
                            "name":"工业园派出所",
                            "code":"131445"
                        }
                    ]
                },
                {
                    "name":"会昌县公安局",
                    "code":"131500",
                    "sub":[
                        {
                            "name":"文武坝派出所",
                            "code":"131501"
                        },
                        {
                            "name":"珠兰派出所",
                            "code":"131502"
                        },
                        {
                            "name":"庄口派出所",
                            "code":"131521"
                        },
                        {
                            "name":"庄埠派出所",
                            "code":"131522"
                        },
                        {
                            "name":"白鹅派出所",
                            "code":"131523"
                        },
                        {
                            "name":"小密派出所",
                            "code":"131524"
                        },
                        {
                            "name":"西江派出所",
                            "code":"131525"
                        },
                        {
                            "name":"麻州派出所",
                            "code":"131526"
                        },
                        {
                            "name":"右水派出所",
                            "code":"131527"
                        },
                        {
                            "name":"高排派出所",
                            "code":"131529"
                        },
                        {
                            "name":"晓龙派出所",
                            "code":"131530"
                        },
                        {
                            "name":"周田派出所",
                            "code":"131531"
                        },
                        {
                            "name":"筠门岭派出所",
                            "code":"131532"
                        },
                        {
                            "name":"清溪派出所",
                            "code":"131533"
                        },
                        {
                            "name":"洞头派出所",
                            "code":"131534"
                        },
                        {
                            "name":"中村派出所",
                            "code":"131535"
                        },
                        {
                            "name":"站塘派出所",
                            "code":"131536"
                        },
                        {
                            "name":"永隆派出所",
                            "code":"131537"
                        },
                        {
                            "name":"富城派出所",
                            "code":"131538"
                        }
                    ]
                },
                {
                    "name":"寻乌县公安局",
                    "code":"131600",
                    "sub":[
                        {
                            "name":"城关派出所",
                            "code":"131601"
                        },
                        {
                            "name":"吉潭派出所",
                            "code":"131602"
                        },
                        {
                            "name":"澄江派出所",
                            "code":"131621"
                        },
                        {
                            "name":"南桥派出所",
                            "code":"131622"
                        },
                        {
                            "name":"留车派出所",
                            "code":"131623"
                        },
                        {
                            "name":"晨光派出所",
                            "code":"131624"
                        },
                        {
                            "name":"桂竹帽派出所",
                            "code":"131625"
                        },
                        {
                            "name":"文峰派出所",
                            "code":"131626"
                        },
                        {
                            "name":"项山派出所",
                            "code":"131627"
                        },
                        {
                            "name":"罗珊派出所",
                            "code":"131629"
                        },
                        {
                            "name":"水源派出所",
                            "code":"131630"
                        },
                        {
                            "name":"三标派出所",
                            "code":"131631"
                        },
                        {
                            "name":"龙廷派出所",
                            "code":"131632"
                        },
                        {
                            "name":"丹溪派出所",
                            "code":"131633"
                        },
                        {
                            "name":"菖蒲派出所",
                            "code":"131634"
                        }
                    ]
                },
                {
                    "name":"石城县公安局",
                    "code":"131700",
                    "sub":[
                        {
                            "name":"琴江派出所",
                            "code":"131701"
                        },
                        {
                            "name":"小松派出所",
                            "code":"131702"
                        },
                        {
                            "name":"横江派出所",
                            "code":"131721"
                        },
                        {
                            "name":"屏山派出所",
                            "code":"131722"
                        },
                        {
                            "name":"高田派出所",
                            "code":"131723"
                        },
                        {
                            "name":"龙岗派出所",
                            "code":"131724"
                        },
                        {
                            "name":"大由派出所",
                            "code":"131725"
                        },
                        {
                            "name":"木兰派出所",
                            "code":"131726"
                        },
                        {
                            "name":"丰山派出所",
                            "code":"131727"
                        },
                        {
                            "name":"珠坑派出所",
                            "code":"131729"
                        }
                    ]
                },
                {
                    "name":"瑞金市公安局",
                    "code":"131800",
                    "sub":[
                        {
                            "name":"象湖派出所",
                            "code":"131801"
                        },
                        {
                            "name":"壬田派出所",
                            "code":"131802"
                        },
                        {
                            "name":"谢坊派出所",
                            "code":"131821"
                        },
                        {
                            "name":"九堡派出所",
                            "code":"131822"
                        },
                        {
                            "name":"瑞林派出所",
                            "code":"131823"
                        },
                        {
                            "name":"沙洲坝派出所",
                            "code":"131824"
                        },
                        {
                            "name":"叶坪派出所",
                            "code":"131825"
                        },
                        {
                            "name":"日东派出所",
                            "code":"131826"
                        },
                        {
                            "name":"黄柏派出所",
                            "code":"131827"
                        },
                        {
                            "name":"大柏地派出所",
                            "code":"131828"
                        },
                        {
                            "name":"丁陂派出所",
                            "code":"131829"
                        },
                        {
                            "name":"冈面派出所",
                            "code":"131830"
                        },
                        {
                            "name":"万田派出所",
                            "code":"131831"
                        },
                        {
                            "name":"云石山派出所",
                            "code":"131832"
                        },
                        {
                            "name":"泽覃派出所",
                            "code":"131833"
                        },
                        {
                            "name":"武阳派出所",
                            "code":"131834"
                        },
                        {
                            "name":"拔英派出所",
                            "code":"131835"
                        }
                    ]
                },
                {
                    "name":"开发区公安分局",
                    "code":"131900",
                    "sub":[
                        {
                            "name":"湖边派出所",
                            "code":"131901"
                        },
                        {
                            "name":"蟠龙派出所",
                            "code":"131902"
                        },
                        {
                            "name":"黄金岭派出所",
                            "code":"131921"
                        },
                        {
                            "name":"凤岗派出所",
                            "code":"131922"
                        },
                        {
                            "name":"三江派出所",
                            "code":"131923"
                        }
                    ]
                },
                {
                    "name":"蓉江新区公安分局",
                    "code":"132000",
                    "sub":[
                        {
                            "name":"潭东派出所",
                            "code":"132001"
                        },
                        {
                            "name":"潭口派出所",
                            "code":"132002"
                        }
                    ]
                },

            ]
        }

    ];
}($);
// jshint ignore: end

/* global $:true */
/* jshint unused:false*/

+ function($) {
    "use strict";

    var defaults;
    var raw = $.rawCitiesData;

    var format = function(data) {
        var result = [];
        for(var i=0;i<data.length;i++) {
            var d = data[i];
            if(/^请选择|市辖区/.test(d.name)) continue;
            result.push(d);
        }
        if(result.length) return result;
        return [];
    };

    var sub = function(data) {
        if(!data.sub) return [{ name: '', code: data.code }];  // 有可能某些县级市没有区
        return format(data.sub);
    };

    var getCities = function(d) {
        for(var i=0;i< raw.length;i++) {
            if(raw[i].code === d || raw[i].name === d) return sub(raw[i]);
        }
        return [];
    };

    var getDistricts = function(p, c) {
        for(var i=0;i< raw.length;i++) {
            if(raw[i].code === p || raw[i].name === p) {
                for(var j=0;j< raw[i].sub.length;j++) {
                    if(raw[i].sub[j].code === c || raw[i].sub[j].name === c) {
                        return sub(raw[i].sub[j]);
                    }
                }
            }
        }
    };

    var parseInitValue = function (val) {
        var p = raw[0], c, d;
        var tokens = val.split(' ');
        raw.map(function (t) {
            if (t.name === tokens[0]) p = t;
        });

        p.sub.map(function (t) {
            if (t.name === tokens[1]) c = t;
        })

        if (tokens[2]) {
            c.sub.map(function (t) {
                if (t.name === tokens[2]) d = t;
            })
        }

        if (d) return [p.code, c.code, d.code];
        return [p.code, c.code];
    }

    $.fn.cityPicker = function(params) {
        params = $.extend({}, defaults, params);
        return this.each(function() {
            var self = this;

            var provincesName = raw.map(function(d) {
                return d.name;
            });
            var provincesCode = raw.map(function(d) {
                return d.code;
            });
            var initCities = sub(raw[0]);
            var initCitiesName = initCities.map(function (c) {
                return c.name;
            });
            var initCitiesCode = initCities.map(function (c) {
                return c.code;
            });
            var initDistricts = sub(raw[0].sub[0]);

            var initDistrictsName = initDistricts.map(function (c) {
                return c.name;
            });
            var initDistrictsCode = initDistricts.map(function (c) {
                return c.code;
            });

            var currentProvince = provincesName[0];
            var currentCity = initCitiesName[0];
            var currentDistrict = initDistrictsName[0];

            var cols = [
                {
                    displayValues: provincesName,
                    values: provincesCode,
                    cssClass: "col-province"
                },
                {
                    displayValues: initCitiesName,
                    values: initCitiesCode,
                    cssClass: "col-city"
                }
            ];

            if(params.showDistrict) cols.push({
                values: initDistrictsCode,
                displayValues: initDistrictsName,
                cssClass: "col-district"
            });

            var config = {

                cssClass: "city-picker",
                rotateEffect: false,  //为了性能
                formatValue: function (p, values, displayValues) {
                    return displayValues.join(' ');
                },
                onChange: function (picker, values, displayValues) {
                    var newProvince = picker.cols[0].displayValue;
                    var newCity;
                    if(newProvince !== currentProvince) {
                        var newCities = getCities(newProvince);
                        newCity = newCities[0].name;
                        var newDistricts = getDistricts(newProvince, newCity);
                        picker.cols[1].replaceValues(newCities.map(function (c) {
                            return c.code;
                        }), newCities.map(function (c) {
                            return c.name;
                        }));
                        if(params.showDistrict) picker.cols[2].replaceValues(newDistricts.map(function (d) {
                            return d.code;
                        }), newDistricts.map(function (d) {
                            return d.name;
                        }));
                        currentProvince = newProvince;
                        currentCity = newCity;
                        picker.updateValue();
                        return false; // 因为数据未更新完，所以这里不进行后序的值的处理
                    } else {
                        if(params.showDistrict) {
                            newCity = picker.cols[1].displayValue;
                            if(newCity !== currentCity) {
                                var districts = getDistricts(newProvince, newCity);
                                picker.cols[2].replaceValues(districts.map(function (d) {
                                    return d.code;
                                }), districts.map(function (d) {
                                    return d.name;
                                }));
                                currentCity = newCity;
                                picker.updateValue();
                                return false; // 因为数据未更新完，所以这里不进行后序的值的处理
                            }
                        }
                    }
                    //如果最后一列是空的，那么取倒数第二列
                    var len = (values[values.length-1] ? values.length - 1 : values.length - 2)
                    $(self).attr('data-code', values[len]);
                    $(self).attr('data-codes', values.join(','));
                    if (params.onChange) {
                        params.onChange.call(self, picker, values, displayValues);
                    }
                },

                cols: cols
            };

            if(!this) return;
            var p = $.extend({}, params, config);
            //计算value
            var val = $(this).val();
            if (!val) val = '北京 北京市 东城区';
            currentProvince = val.split(" ")[0];
            currentCity = val.split(" ")[1];
            currentDistrict= val.split(" ")[2];
            if(val) {
                p.value = parseInitValue(val);
                if(p.value[0]) {
                    var cities = getCities(p.value[0]);
                    p.cols[1].values = cities.map(function (c) {
                        return c.code;
                    });
                    p.cols[1].displayValues = cities.map(function (c) {
                        return c.name;
                    });
                }

                if(p.value[1]) {
                    if (params.showDistrict) {
                        var dis = getDistricts(p.value[0], p.value[1]);
                        p.cols[2].values = dis.map(function (d) {
                            return d.code;
                        });
                        p.cols[2].displayValues = dis.map(function (d) {
                            return d.name;
                        });
                    }
                } else {
                    if (params.showDistrict) {
                        var dis = getDistricts(p.value[0], p.cols[1].values[0]);
                        p.cols[2].values = dis.map(function (d) {
                            return d.code;
                        });
                        p.cols[2].displayValues = dis.map(function (d) {
                            return d.name;
                        });
                    }
                }
            }
            $(this).picker(p);
        });
    };

    defaults = $.fn.cityPicker.prototype.defaults = {
        showDistrict: true //是否显示地区选择
    };

}($);
